app/controllers/cities_controller.rb

  def index
    @cities = City.all
---
SELECT "cities".* FROM "cities"

  def show
    @city = City.find(params[:id])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @city = City.find(params[:id])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @city = City.new(params[:city])

    respond_to do |format|
      if @city.save
---
INSERT INTO "cities" ("created_at", "latitude", "longitude", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Thu, 23 Aug 2012 18:04:33 UTC +00:00], ["latitude", nil], ["longitude", nil], ["name", "San Francisco"], ["updated_at", Thu, 23 Aug 2012 18:04:33 UTC +00:00]]

  def update
    @city = City.find(params[:id])

    respond_to do |format|
      if @city.update_attributes(params[:city])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "cities" SET "name" = 'Los Angeles', "latitude" = 34.0522342, "longitude" = -118.2436849, "postal_code" = '90012', "region_code" = 'CA', "updated_at" = '2012-08-23 18:59:48.145413' WHERE "cities"."id" = 6