app/controllers/home_controller.rb

  def landing
    @cities = City.all
---
SELECT "cities".* FROM "cities"